In [1]:
import pandas as pd

In [2]:
Team1 = {
    'Player': ['Jack', 'Mat', 'Steve', 'Tyler', 'Eric'],
    'Pos': ['CF', 'SS', 'MC', 'DFB', 'GK'],
    'Score': [75, 80, 73, 64, 70]
}
Team2 = {
    'Player': ['Alex', 'Daniel', 'Fred', 'Tom', 'Mark'],
    'Pos': ['CF', 'MCD', 'MC', 'DFB', 'GK'],
    'Score': [68, 86, 64, 59, 70]
}
team1_df = pd.DataFrame(Team1)
team2_df = pd.DataFrame(Team2)

In [3]:
team1_df

  Player  Pos  Score
0   Jack   CF     75
1    Mat   SS     80
2  Steve   MC     73
3  Tyler  DFB     64
4   Eric   GK     70

In [4]:
team2_df

   Player  Pos  Score
0    Alex   CF     75
1  Daniel  MCD     80
2    Fred   MC     73
3     Tom  DFB     64
4    Mark   GK     70

In [7]:
# Merge data ( Like datbase join )
pd.merge(team1_df, team2_df, suffixes=['_t1', '_t2'], on = ['Pos'])

  Player_t1  Pos  Score_t1 Player_t2  Score_t2
0      Jack   CF        75      Alex        75
1     Steve   MC        73      Fred        73
2     Tyler  DFB        64       Tom        64
3      Eric   GK        70      Mark        70